benchmarks/cylinder/bodyFittedNeoN/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| Laminar Re=20 wake — no turbulence model.                                     |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType  laminar;

// ************************************************************************* //
