benchmarks/cylinder/bodyFittedNeoN/system/blockMeshDict
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  v1806/v10                             |
|   \  /    A nd           | Web:      https://www.OpenFOAM.com              |
|    \/     M anipulation  |           https://www.OpenFOAM.org              |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// x10 vs the classy_blocks output so D = 0.2 (matches the blockAMR case);
// with nu = 0.01 that is Re = U*D/nu = 1*0.2/0.01 = 20. Scaling is uniform, so
// cell COUNTS are unchanged — only the absolute cell size becomes comparable to
// blockAMR (dx_base = 3.75e-3), which is what the matched-cell-size study needs.
scale 10;

// The z (front/back) faces are unassigned by the block faces below, so they
// land in this patch. A real 'patch' (not 'empty') makes the mesh genuine 3D
// when the harness extrudes it to K>1 layers (frontAndBack -> slip in 0.orig).
defaultPatch
{
    name    frontAndBack;
    type    patch;
}

vertices
(
	(0.00707107 0.00707107 0.00000000) // 0
	(0.01060660 0.01060660 0.00000000) // 1
	(-0.01060660 0.01060660 0.00000000) // 2
	(-0.00707107 0.00707107 0.00000000) // 3
	(0.00707107 0.00707107 0.01000000) // 4
	(0.01060660 0.01060660 0.01000000) // 5
	(-0.01060660 0.01060660 0.01000000) // 6
	(-0.00707107 0.00707107 0.01000000) // 7
	(-0.01060660 -0.01060660 0.00000000) // 8
	(-0.00707107 -0.00707107 0.00000000) // 9
	(-0.01060660 -0.01060660 0.01000000) // 10
	(-0.00707107 -0.00707107 0.01000000) // 11
	(0.01060660 -0.01060660 0.00000000) // 12
	(0.00707107 -0.00707107 0.00000000) // 13
	(0.01060660 -0.01060660 0.01000000) // 14
	(0.00707107 -0.00707107 0.01000000) // 15
	(-0.10000000 0.01060660 0.00000000) // 16
	(-0.01060660 0.05000000 0.00000000) // 17
	(-0.10000000 0.05000000 0.00000000) // 18
	(-0.10000000 0.01060660 0.01000000) // 19
	(-0.01060660 0.05000000 0.01000000) // 20
	(-0.10000000 0.05000000 0.01000000) // 21
	(0.01060660 0.05000000 0.00000000) // 22
	(0.01060660 0.05000000 0.01000000) // 23
	(0.30000000 0.01060660 0.00000000) // 24
	(0.30000000 0.05000000 0.00000000) // 25
	(0.30000000 0.01060660 0.01000000) // 26
	(0.30000000 0.05000000 0.01000000) // 27
	(-0.10000000 -0.01060660 0.00000000) // 28
	(-0.10000000 -0.01060660 0.01000000) // 29
	(0.30000000 -0.01060660 0.00000000) // 30
	(0.30000000 -0.01060660 0.01000000) // 31
	(-0.10000000 -0.05000000 0.00000000) // 32
	(-0.01060660 -0.05000000 0.00000000) // 33
	(-0.10000000 -0.05000000 0.01000000) // 34
	(-0.01060660 -0.05000000 0.01000000) // 35
	(0.01060660 -0.05000000 0.00000000) // 36
	(0.01060660 -0.05000000 0.01000000) // 37
	(0.30000000 -0.05000000 0.00000000) // 38
	(0.30000000 -0.05000000 0.01000000) // 39
);

blocks
(
	hex ( 0 1 2 3 4 5 6 7 )  ( 14 53 1 ) simpleGrading ( 10.699320537907195 1 1 ) // 0
	hex ( 3 2 8 9 7 6 10 11 )  ( 14 53 1 ) simpleGrading ( 10.699320537907195 1 1 ) // 1
	hex ( 9 8 12 13 11 10 14 15 )  ( 14 53 1 ) simpleGrading ( 10.699320537907195 1 1 ) // 2
	hex ( 13 12 1 0 15 14 5 4 )  ( 14 53 1 ) simpleGrading ( 10.699320537907195 1 1 ) // 3
	hex ( 16 2 17 18 19 6 20 21 )  ( 239 106 1 ) simpleGrading ( 1 1 1 ) // 4
	hex ( 2 1 22 17 6 5 23 20 )  ( 53 106 1 ) simpleGrading ( 1 1 1 ) // 5
	hex ( 1 24 25 22 5 26 27 23 )  ( 772 106 1 ) simpleGrading ( 1 1 1 ) // 6
	hex ( 28 8 2 16 29 10 6 19 )  ( 239 53 1 ) simpleGrading ( 1 1 1 ) // 7
	hex ( 12 30 24 1 14 31 26 5 )  ( 772 53 1 ) simpleGrading ( 1 1 1 ) // 8
	hex ( 32 33 8 28 34 35 10 29 )  ( 239 106 1 ) simpleGrading ( 1 1 1 ) // 9
	hex ( 33 36 12 8 35 37 14 10 )  ( 53 106 1 ) simpleGrading ( 1 1 1 ) // 10
	hex ( 36 38 30 12 37 39 31 14 )  ( 772 106 1 ) simpleGrading ( 1 1 1 ) // 11
);

edges
(
	// arc 0 3 origin 1 (0.00000000 0.00000000 0.00000000)
	arc 0 3 (0.00000000 0.01000000 0.00000000)
	// arc 1 2 origin 1 (0.00000000 0.00000000 0.00000000)
	arc 1 2 (0.00000000 0.01500000 0.00000000)
	// arc 4 7 origin 1 (0.00000000 0.00000000 0.01000000)
	arc 4 7 (0.00000000 0.01000000 0.01000000)
	// arc 5 6 origin 1 (0.00000000 0.00000000 0.01000000)
	arc 5 6 (0.00000000 0.01500000 0.01000000)
	// arc 3 9 origin 1 (0.00000000 0.00000000 0.00000000)
	arc 3 9 (-0.01000000 0.00000000 0.00000000)
	// arc 2 8 origin 1 (0.00000000 0.00000000 0.00000000)
	arc 2 8 (-0.01500000 0.00000000 0.00000000)
	// arc 7 11 origin 1 (0.00000000 0.00000000 0.01000000)
	arc 7 11 (-0.01000000 0.00000000 0.01000000)
	// arc 6 10 origin 1 (0.00000000 0.00000000 0.01000000)
	arc 6 10 (-0.01500000 0.00000000 0.01000000)
	// arc 9 13 origin 1 (0.00000000 0.00000000 0.00000000)
	arc 9 13 (-0.00000000 -0.01000000 0.00000000)
	// arc 8 12 origin 1 (0.00000000 0.00000000 0.00000000)
	arc 8 12 (-0.00000000 -0.01500000 0.00000000)
	// arc 11 15 origin 1 (0.00000000 0.00000000 0.01000000)
	arc 11 15 (-0.00000000 -0.01000000 0.01000000)
	// arc 10 14 origin 1 (0.00000000 0.00000000 0.01000000)
	arc 10 14 (-0.00000000 -0.01500000 0.01000000)
	// arc 13 0 origin 1 (0.00000000 0.00000000 0.00000000)
	arc 13 0 (0.01000000 0.00000000 0.00000000)
	// arc 12 1 origin 1 (0.00000000 0.00000000 0.00000000)
	arc 12 1 (0.01500000 0.00000000 0.00000000)
	// arc 15 4 origin 1 (0.00000000 0.00000000 0.01000000)
	arc 15 4 (0.01000000 0.00000000 0.01000000)
	// arc 14 5 origin 1 (0.00000000 0.00000000 0.01000000)
	arc 14 5 (0.01500000 0.00000000 0.01000000)
);

faces
(
);

boundary
(
	cylinder
	{
		type patch;
		faces
		(
			(4 0 3 7)
			(7 3 9 11)
			(11 9 13 15)
			(15 13 0 4)
		);
	}
	upper_wall
	{
		type patch;
		faces
		(
			(21 20 17 18)
			(20 23 22 17)
			(23 27 25 22)
		);
	}
	inlet
	{
		type patch;
		faces
		(
			(19 16 18 21)
			(29 28 16 19)
			(34 32 28 29)
		);
	}
	outlet
	{
		type patch;
		faces
		(
			(26 24 25 27)
			(31 30 24 26)
			(39 38 30 31)
		);
	}
	lower_wall
	{
		type patch;
		faces
		(
			(34 35 33 32)
			(35 37 36 33)
			(37 39 38 36)
		);
	}
);

mergePatchPairs
(
);

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// Created with classy_blocks: https://github.com/damogranlabs/classy_blocks //
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
